// Να γράψετε πρόγραμμα που να δέχεται ως παράμετρο γραμμής εντολών έναν ακέραιο αριθμό και να εμφανίζει το
// άθροισμα όλων των θετικών ακεραίων που είναι μικρότεροι ή ίσοι του αριθμού αυτού (οι σχετικές μεταβλητές να
// δηλωθούν ως τύπου long long). Για τον υπολογισμό του αθροίσματος να χρησιμοποιεί νήματα. Ο αριθμός των
// νημάτων θα περνά επίσης ως παράμετρος γραμμής εντολών. Υπολογίστε το άθροισμα των πρώτων 10.000.000
// ακέραιων αριθμών χρησιμοποιώντας 4 νήματα. Γράψτε τις εντολές μεταγλώττισης και εκτέλεσης του
// προγράμματος

// gcc ask2.c -fopenmp -o ask2
// ./ask2 10000000 4

#include <stdio.h>
#include <stdlib.h>
#include <omp.h>

int main(int argc, char *argv[])
{
	if (argc != 3)
	{
		printf("Χρήση: %s <μέγιστος_αριθμός> <αριθμός_νημάτων>\n", argv[0]);
		return 1;
	}

	long long n = atoll(argv[1]);
	int threads = atoi(argv[2]);
	long long sum = 0;

#pragma omp parallel for num_threads(threads) reduction(+ : sum)
	for (long long i = 1; i <= n; i++)
	{
		sum += i;
	}

	printf("Άθροισμα: %lld\n", sum);
	return 0;
}